Дошкольное_учреждение83/src/InformationRegisters/удуНастройкиРегистрацииДокументов/удуНастройкиРегистрацииДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>удуНастройкиРегистрацииДокументов</name>
  <resources>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
      <types>CatalogRef.ВидыВходящихДокументов</types>
      <types>CatalogRef.ВидыИсходящихДокументов</types>
    </type>
  </resources>
  <resources>
    <name>ГрифДоступа</name>
    <type>
      <types>CatalogRef.ГрифыДоступа</types>
    </type>
  </resources>
  <resources>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>РегистрироватьДокумент</name>
    <comment>Зарегистрировать документ автоматически</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидУчетногоДокумента</name>
    <type>
      <types>EnumRef.удуВидыУчетныхДокументов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дошкольное_учреждение83/src/InformationRegisters/удуНастройкиРегистрацииДокументов/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ВидДокументаПриИзменении(Элемент)	
	УстановитьДоступностьПапокИГрифов();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьПапокИГрифов()
	Если ЗначениеЗаполнено(Запись.ВидДокумента) Тогда
		ДоступностьПапокВнутреннихДокументов = (ТипЗнч(Запись.ВидДокумента) = Тип("СправочникСсылка.ВидыВнутреннихДокументов"));
		Если ДоступностьПапокВнутреннихДокументов Тогда
			Запись.ГрифДоступа = Справочники.ГрифыДоступа.ПустаяСсылка();			
		Иначе
			Запись.Папка = Справочники.ПапкиВнутреннихДокументов.ПустаяСсылка();
		КонецЕсли;
		Элементы.ГрифДоступа.Доступность = Не ДоступностьПапокВнутреннихДокументов;
		Элементы.Папка.Доступность = ДоступностьПапокВнутреннихДокументов;
	Иначе
		Элементы.ГрифДоступа.Доступность = Ложь;
		Элементы.Папка.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьПапокИГрифов();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТипЗнч(Запись.ВидДокумента) = Тип("СправочникСсылка.ВидыВнутреннихДокументов") Тогда
		Если Запись.Папка = Справочники.ПапкиВнутреннихДокументов.ПустаяСсылка() Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст="Поле ""Папка"" не заполнено";		
			СообщениеПользователю.Сообщить();
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	Иначе
		Если Константы.ИспользоватьГрифыДоступаКВходящимИИсходящимДокументам И Запись.ГрифДоступа = Справочники.ГрифыДоступа.ПустаяСсылка() Тогда
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст="Поле ""Гриф доступа"" не заполнено";
			СообщениеПользователю.Сообщить();
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры
